def get_skill_cost(攻击方, 数量=None):
    if not 数量:
        数量 = 1
    技能名称=攻击方['战斗命令']['参数']
    if (技能名称=='横扫千军' or 技能名称=='破釜沉舟' )and 攻击方.当前气血>=攻击方.最大气血*0.5:
        return '魔法',0,1
    elif 技能名称=='天命剑法' and 攻击方.当前气血>=攻击方.最大气血*0.7:
        return '魔法',0,1
    elif 技能名称=='由己渡人' and 攻击方.当前气血>攻击方.最大气血*0.1:
        return '魔法',0,1
    elif 技能名称=='鸣雷诀' and 攻击方.当前气血>=攻击方.最大气血*0.3:
        return '魔法',0,1
    elif 技能名称=='移魂化骨' and 攻击方.当前气血>=攻击方.最大气血*0.3:
        return '魔法',0,1
    elif 技能名称=='烟雨剑法' and 攻击方.当前气血>=攻击方.最大气血*0.7:
        return '魔法',50,1
    elif (技能名称=='后发制人' or 技能名称=='剑荡四方') and 攻击方.当前气血>=攻击方.最大气血*0.1:
        return '魔法',0,1
    elif (技能名称=='炼气化神' or 技能名称=='三花聚顶' or 技能名称=='魔息术' or 技能名称 == '乾天罡气' or 技能名称 == '移星换斗')and 攻击方.当前气血>30:
        攻击方.当前气血=攻击方.当前气血-30
        return '魔法',0,1
    elif 技能名称=='断岳势':
        return '魔法',50,1
    elif 技能名称=='天崩地裂':
        return '魔法',50,1
    elif 技能名称=='浪涌':
        pass
    if 攻击方.战意点数 < 6:
        攻击方.战意点数  = 攻击方.战意点数 + 1
        return '魔法',30,数量
    elif 技能名称=='惊涛怒' or 技能名称=='流沙轻音' or 技能名称=='叱咤风云' or 技能名称=='食指大动':
        return '魔法',30,数量
    elif 技能名称=='翻江搅海':
        return '魔法',20,数量
    elif 技能名称=='腾雷':
        return '魔法',60,数量
    elif 技能名称=='镇魂诀' and 攻击方.当前气血>攻击方.气血上限*0.05 :
    # 攻击方.当前气血=math.floor(攻击方.当前气血*0.95)
        return '魔法',0,1
    elif 技能名称=='地涌金莲' and 攻击方.当前气血>攻击方.气血上限*0.05 :
    # 攻击方.当前气血=math.floor(攻击方.当前气血*0.97)
        return '魔法',50,1
    elif 技能名称=='血雨' and 攻击方.当前气血>=攻击方.气血上限*0.5:
    # 攻击方.当前气血=math.floor(攻击方.当前气血*0.8)
        return '魔法',0,1
    elif 技能名称=='我佛慈悲':
        return '魔法',150,1
    elif 技能名称 == '月下霓裳' or 技能名称 == '同伤式' or 技能名称 == '风林火山' or 技能名称 == '花语歌谣' or 技能名称 == '龙战于野' or 技能名称 == '魔火焚世' or 技能名称 == '无双战魂' or 技能名称 == '媚眼如丝':
        return '魔法',50,1
    elif  技能名称=='救死扶伤' or 技能名称=='舍生取义' or 技能名称=='还阳术' or 技能名称=='佛法无边' or 技能名称=='杨柳甘露' or 技能名称=='还魂咒' or 技能名称=='修罗隐身' or 技能名称=='不动如山' :
        return '魔法',150,1
    elif 技能名称=='金身舍利' or 技能名称=='神龙摆尾' or 技能名称=='摧心术' or 技能名称=='明光宝烛' or 技能名称=='上古灵符' or 技能名称=='威震凌霄' or 技能名称=='哼哼哈兮' or 技能名称=='无畏布施' or 技能名称=='气慑天军' or 技能名称=='惊心一剑' or 技能名称=='月光' or 技能名称=='唤魔·毒魅' or 技能名称=='匠心·削铁'  or 技能名称=='匠心·固甲'  or 技能名称=='唤灵·焚魂' or 技能名称=='天魔觉醒':
        return '魔法',100,1
    elif 技能名称=='分身术' or 技能名称=='妙手回春' or 技能名称=='知己知彼' or 技能名称=='颠倒五行' or 技能名称=='匠心·蓄锐':
        return '魔法',80,1
    elif 技能名称=='活血'  or 技能名称=='净土灵华' or 技能名称=='推拿' or 技能名称=='否极泰来' or 技能名称=='针灸':
        return '魔法',70,1
    elif 技能名称=='二龙戏珠' or 技能名称=='诱袭':
        return '魔法',70,1
    elif 技能名称=='云暗天昏' or 技能名称=='无所遁形' or 技能名称=='铜头铁臂'   or 技能名称=='当头一棒'  or 技能名称=='神针撼海'  or 技能名称=='杀威铁棒'  or 技能名称=='泼天乱棒':
        return '魔法',75,1
    elif 技能名称=='失心符' or 技能名称=='失魂符' or 技能名称=='飞花摘叶' or 技能名称=='一笑倾城' or 技能名称=='定身符' or 技能名称=='错乱' or 技能名称=='百万神兵' or 技能名称=='解封' or 技能名称=='火甲术' or 技能名称=='复苏' or 技能名称=='无穷妙道' or 技能名称=='莲花心音':
        return '魔法',60,1
    elif 技能名称=='追魂符':
        return '魔法',55,1
    elif 技能名称=='失忆符' or 技能名称=='似玉生香' or 技能名称=='离魂符' or 技能名称=='凝神术' or 技能名称=='推拿' or 技能名称=='天神护体' or 技能名称=='五雷轰顶' or 技能名称=='掌心雷' or 技能名称=='天地同寿' or 技能名称=='乾坤妙法' or 技能名称=='紧箍咒' or 技能名称=='苍茫树' or 技能名称=='地裂火' or 技能名称=='日光华' or 技能名称=='巨岩破'  or 技能名称=='靛沧海' or 技能名称=='寡欲令' or 技能名称=='黄泉之息' or 技能名称=='锢魂术' or 技能名称=='摇头摆尾' or 技能名称=='象形' or 技能名称=='姐妹同心' or 技能名称=='幻镜术' or 技能名称=='裂石' or 技能名称=='四面埋伏' or 技能名称=='煞气诀' or 技能名称=='惊魂掌' or 技能名称=='雾杀' or 技能名称=='星月之惠' or  技能名称=='潜力激发' or 技能名称=='金刚镯' or 技能名称=='壁垒击破' or 技能名称=='八戒上身' or 技能名称=='治疗'  or 技能名称=='蚩尤之搏'   or 技能名称=='翩鸿一击' or 技能名称=='长驱直入':
        return '魔法',50,1
    elif 技能名称=='催眠符' or 技能名称=='镇妖' or 技能名称=='驱魔' or 技能名称=='含情脉脉':
        return '魔法',45,1
    elif 技能名称=='杀气诀' or 技能名称=='满天花雨' or 技能名称=='落魄符' or 技能名称=='金刚护法' or 技能名称=='解毒' or 技能名称=='莲步轻舞' or 技能名称=='娉婷嬝娜' or 技能名称=='逆鳞' or 技能名称=='乘风破浪' or 技能名称=='驱尸' or 技能名称=='尸腐毒' or 技能名称=='魂飞魄散' or 技能名称=='无敌牛虱' or 技能名称=='无敌牛妖' or 技能名称=='定心术' or 技能名称=='勾魂' or 技能名称=='魔音摄魂' or 技能名称=='盘丝阵':
        return '魔法',40,1
    elif 技能名称=='韦陀护法' or 技能名称=='如花解语' or 技能名称=='日月乾坤' or 技能名称=='摄魄':
        return '魔法',35,1
    elif 技能名称=='反间之计' or 技能名称=='红袖添香' or 技能名称=='安神诀' or 技能名称=='五雷咒' or 技能名称=='达摩护体' or 技能名称=='金刚护体' or 技能名称=='百毒不侵' or 技能名称=='一苇渡江' or 技能名称=='楚楚可怜' or 技能名称=='天神护法' or 技能名称=='宁心' or 技能名称=='天雷斩' or 技能名称=='清心' or 技能名称=='龙腾' or 技能名称=='龙吟' or 技能名称=='灵动九天' or 技能名称=='自在心法' or 技能名称=='魔王回首' or 技能名称=='极度疯狂' or 技能名称=='天魔解体' or 技能名称=='碎星诀' or 技能名称=='夺魄令' or 技能名称=='荆棘舞' or 技能名称=='尘土刃' or 技能名称=='冰川怒' or 技能名称=='炎护' or  技能名称=='死亡召唤' or  技能名称=='唤灵·魂火' or  技能名称=='呼子唤孙' or  技能名称=='炽火流离' or  技能名称=='怨怖之泣' or  技能名称=='谜毒之缚':
        return '魔法',30,1
    elif 技能名称=='推气过宫' or 技能名称=='救死扶伤' or 技能名称=='妙手回春' or 技能名称=='醍醐灌顶'  :
        return '魔法',30,1
    elif 技能名称=='归元咒' or 技能名称=='幽冥鬼眼' or 技能名称=='牛劲' or 技能名称=='威慑' or 技能名称=='变身' or 技能名称=='仙人指路':
        return '魔法',20,1
    elif  技能名称=='判官令':
        return '魔法',20,1
    elif 技能名称=='碎甲符' or 技能名称=='普渡众生' or 技能名称=='清静菩提' or 技能名称=='大闹天宫' or 技能名称=='水攻' or 技能名称=='落岩' or 技能名称=='烈火' or 技能名称=='雷击'  or 技能名称=='锋芒毕露' or 技能名称=='针锋相对' or 技能名称=='一发而动' or 技能名称=='净世煌火' or 技能名称=='焚魔烈焰' or 技能名称=='唤魔·堕羽' :
        return '魔法',50,数量
    elif  技能名称=='九天玄火':
        return '魔法',45,1
    elif  技能名称=='雷霆万钧'  or 技能名称=='百爪狂杀' or 技能名称=='无间地狱':
        return '魔法',35,数量
    elif 技能名称=='落雷符' or 技能名称=='生命之泉' or 技能名称=='飘渺式' or 技能名称=='飞砂走石' or 技能名称=='三昧真火' or 技能名称=='鹰击' or 技能名称=='狮搏' or 技能名称=='连环击' or 技能名称=='天罗地网' or 技能名称=='瘴气' or 技能名称=='落叶萧萧' or 技能名称=='泰山压顶' or 技能名称=='奔雷咒' or 技能名称=='地狱烈火' or 技能名称=='神来气旺'  or 技能名称=='水漫金山' or 技能名称=='破击'  or 技能名称=='法术防御' or 技能名称=='天降灵葫' or 技能名称=='八凶法阵':
        return '魔法',30,数量
    elif  技能名称=='疯狂鹰击':
        return '魔法',100,数量
    elif 技能名称=='蜜润' :
        return '魔法',25,数量
    elif 技能名称=='唧唧歪歪' or 技能名称=='龙卷雨击' or 技能名称=='阎罗令' or 技能名称=='夺命咒':
        return '魔法',20,数量
    elif 技能名称=='扶摇万里' :
        return '魔法',12,数量
    elif 技能名称=='雨落寒沙' :
        return '魔法',10,数量
    elif 技能名称=='善恶有报' or  技能名称=='夜舞倾城' or  技能名称=='波澜不惊' :
        return '魔法',80,数量
    elif 技能名称=='力劈华山':
        return '魔法',80,数量
    elif 技能名称=='进阶力劈华山' or  技能名称=='进阶善恶有报':
        return '魔法',5,数量
    elif 技能名称=='九幽' or 技能名称=='金钱镖' or 技能名称=='落雨金钱' or 技能名称=='峰回路转':
        return '魔法',0,1
    elif 技能名称=='九幽' or 技能名称=='金钱镖' or 技能名称=='落雨金钱' or 技能名称=='峰回路转'  or 技能名称=='断穹巨剑'   :
        return '魔法',0,1
    elif 技能名称=='静心禅珠' or 技能名称=='伏魔灵圈' or 技能名称=='真阳令旗' or 技能名称=='寒霜盾戟' or 技能名称=='天雷音鼓' or 技能名称=='化怨清莲' or  技能名称=='宁心道符' or 技能名称=='九霄龙锥' or 技能名称=='相思寒针' or 技能名称=='风舞心经' or 技能名称=='神匠火炮'  or 技能名称=='锢魂命谱' or 技能名称=='青狮獠牙' or  技能名称=='冥火炼炉' or 技能名称=='三彩琉璃'  or 技能名称=='缚仙蛛丝' or 技能名称=='煞魂冥灯':
        return '魔法',0,1
    elif 技能名称 == '牛刀小试':
        return '魔法',30,1
    return False