
# 客户端网络数据包序号


C_账号登陆 = 11
C_更新坐标 = 21
C_发送路径 = 31
C_点击NPC = 41
C_传送点传送 = 51
C_获取所有物品信息 = 61
C_申请成为队长 = 71
C_申请组队 = 81
C_人物确认加点 = 91
C_角色升级 = 101
C_角色发言 = 111
C_创建账号 = 121
C_创建角色 = 131
C_角色进入 = 141
C_进入场景 = 151
C_对话选项 = 16

# 服务端网络数据包序号

# system: 1-200
S_账号所有人物 = 1

S_添加玩家 = 11
S_发送路径 = 21
S_进入场景 = 31
S_发送主角信息 = 41
S_离开场景 = 51
S_系统错误 = 61
S_NPC数据 = 71
S_发送NPC对话 = 81
S_场景传送 = 91
S_清除场景人物 = 101
S_发送传送点 = 111
S_发送所有物品信息 = 121
S_刷新玩家数据 = 131
S_加入队伍 = 141
S_退出队伍 = 151
S_玩家停止移动 = 116
S_玩家寻路 = 171
S_系统提示 = 181
S_人物一次性特效 = 191
S_频道发言 = 201
S_角色数据 = 211
S_登陆成功 = 221
S_角色发言显示 = 231
S_所有NPC数据 = 24
S_地图传送 = 25
S_人场景一次性特效 = 26
S_删除玩家 = 27
